{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"At Maggiano's, the portions are huge, and we've always found it is more economical to order several dishes and share rather than ordering off their family menu.\r\n\r\nThis location is at one end of the Fashion Show mall (http://www.yelp.com/biz/rXUBAFqrr00KvVEJ6aNURw?hrid=OYsZi4R_-xj0UuVtTe5vPg).  The non-smoking section has a Strip view; the whole place feels very airy with lots of windows.\r\n\r\nVegan Report: Getting the bruschetta (without cheese) and the minestrone soup (without cheese) always makes me a happy lady."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"The moment we got to Vegas last weekend, my friend insisted we go to this place.  I really wasn't in the mood for Italian food but the group wanted it, so I was out of luck.\n\nAfter a rather long wait for a non-buffet restaurant (20-25 min), we were seated.  We got the insalata caprese (although they didn't call it that), and the spinach and feta raviolio and manicotti and finished with the creme brulee.  The portions are rather large, so with a guy and 3 girls, the above menu was enough.\n\nThe prices were very fair, especially considering it was Vegas and that it was considered a very good restaurant.  The wine selection was decent.  If you're not in the mood to go bankrupt at Nobu, Lupo, or Postrio, go to Maggiano's for some very reasonable and altogether excellent Italian food in a great setting."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"The food at Maggianos is absolutely superb. Knowing that Las Vegas has a rep for the ultra high end, Maggianos was the best I had.\n\nThe profiterole rolls were absolutely divine and the setting a little reminiscent of pastis in New York."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"The best Italian food I've had in Vegas and the best bruschetta I've ever had anywhere (admittedly I've not yet actually been to Italy though).  The menu options were original and everything we ordered was both extraordinarily flavorful and fresh.  We were there for lunch and the prices were a steal (for example, the $6 bruschetta was the size of a meal in itself and the wine by the glass was also reasonable by Vegas standards).  \n\nOur waiter was nothing special, but we wanted for nothing.  And while the dining experience for me is usually diminished when dining in a mall (even a Vegas mall), I found that the location was actually quite nice and lended itself to great views of the strip.  I would have liked to have tried the desserts but I hardly could finish my meal because of the large portions--I guess that means I'll have to go back."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"An average PF Chang, Cheesecake Factory quality chain restaurant located at the very fashionable Fashion Show Mall.  For Vegas, this might be 5-star but for me it is only 3.  Sorry.\n\nBring your appetite -- portions are buffet style."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"Great atmosphere, great fresh food. The plates have just the right amount of flavor, even the \"heaviest\" dishes end up being pretty light. The prices are really good and accommodate every appetite since most plates are available in full and half size.\nWe spent 4 days in Vegas and had dinner at the Maggiano's twice!"}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"This place is sooooo yummy! I went for dinner and there was a little bit of a wait but it wasn't too bad. There's not much of a waiting area which sucks because it feels like you're always in the way. Once we were seated it was more of the same. The tables were very close together and people kept squeezing by our table which truly annoyed me. For that reason i had to remove one star. However everything else was superb! I had the lobster ravioli which was delicious. In fact I'm making myself hungry just thinking about it! I also had a Caramel apple martini which was delicious! I had to get another. By the end of the meal my belly was full and my body was tipsy. I'd say that's a perfect way to end the day! :-)"}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"Maggiano's Little Italy is on the second floor of the Fashion Show Mall, across from the Wynn and Treasure Island on Las Vegas Blvd. \n\nMaggiano's is a chain restaurant that can be found in over 20 states. I have eaten at the one in Minneapolis as well as this one. I guess in the hiearchy of Italian food Chain restaurants it goes something like this:\n\nOut of the can and not Italian: Chef Boyardee\nSlightly better Casual not Italian: Olive Garden and Macaroni Grill\nA little better if you didn't know better: Pasta Pomodoro \nMid-level trying to fool you as high-end Italian: Maggiano's and Buca de Beppo\nHigher prices and more Northern Italian: Il Forniao\nReally great Italian: don't tend to be chain restaurants \n\nMaggiano's has nice ambiance, expensive dark wood decor, and is usually very popular and crowded. In Vegas expect to wait even with a reservation. We had a party of 10, called at 5 and couldn't get reservation until 8:30. Maggiano's is perfect for large parties, as they offer huge dishes that are meant to be shared (most have a half size option, so take it!) They offer a family style approach special menu for large groups, where the cost is $29.95 per person, and includes 2 shared appetizers, 2 pastas, and 2 mains in a bottomless approach. They encourage this, as they will tell you if you order a la carte, it may take 30 - 45 minutes (for Pasta?). we went a la carte because some didn;t want to comprimise into limited selections. \n\nThe Mozzarella Buffula appetizer (what they called Tomato Slice and Mozzarella, or something like that) is one of my favorite Italian appetizers. The special goat mozzarella with a basil leaf over a tomato slice is a nice combination, Maggiano's shreds the basil, which I prefer the fresh whole leaf. You get 3 slices with an order. \n\nThe Capellini d'arrabiata (which they call by the English name of Angel Hair) comes in a huge bowl with about 1/2 to 1 pound of pasta, roma tomatoes, garlic and a little oil, with some basil, and a slightly spicey arrabiata sauce. They have a couple of lasagna offerings, either covered in a bolognese (ground beef) sauce or in a Marinara. It is huge, like everything is. There is a large menu of good selections for most people. \n\nThey don't offer olive oil and balsamic vinegar with your bread, but if you ask for it, they will bring it to you. \n\nIf you want A LOT of food and willing to pay over $30 per person for Pasta, go here."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"I dined here on a Monday by myself at 6pm - it was busy but I was seated at a booth without hesitation.\n\nThe menu is vegetarian friendly - I chose to get the half-order of spaghetti with a mixture of marinara and white sauce. While waiting for my entree, I munched on the fresh bread that I dipped in olive oil - mmmmm!\n\nThe spaghetti was good - I would have finished it if hadn't eaten the bread.\n\nMy waitress was friendly, attentive and efficient.\n\nYeah, its a chain but for the price point and compared to what's around, you get not only a good deal but good food too."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"Good Italian food although the hostess took forever to seat us. Our server was much better and the food was good. We got the chopped salad which was great and the pesto, chicken, pine nut linguine. It actually wasn't spectacular but it was much better later that night for dinner."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"I've seen Maggianos in other cities, but this was my first time dining at one.  We decided to have our meal \"family style\" which was recommend by my brother and his fiancee.   \n\nThe food was pretty good, in particular we enjoyed the mussels and loved  the Tiramisu.  Our server was excellent.  They also have some reasonably priced wines available.\n\nI've heard mixed things about this chain, but was pretty impressed with my visit.  Family style definitely seems to be the way to go when dining here."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"Food: Food here was excellent. I had the chicken parmigiana which also came with a side of spaghetti or fettuccine . The spaghetti was delicious and the chicken was also very tasty and moist. Portions were huge,especially for lunch time!\n\nPrice: Prices are modercheap! why go to an expensive Italian place on the strip when you can dine here for half the price and get good quality food!\n\nAtmosphere: I liked dining here. It was quiet, relaxing and great for groups or family dining.\n\nService: Service was great. Our waitress was very friendly and attentive.  Our water glasses were always refilled. \n\nLocation: Located in Fashion Show Mall on the second floor. Great to dine after/before shopping!"}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"Please try the bruschetta. Really good and you can taste the fresh garlic. Very good service and the food is good."}
{"categories":["Bars","Restaurants","Nightlife","Italian"],"text":"We went here last Thursday around 7pm and goooooood loooooord was it a long wait for a table.  I was surprised this place was as packed as it was.  Definitely make a reservation..even on a Thursday!\n\nAside from that the food was decent.  The wife went for the lasagna after rave reviews from my 78 year old coworker who said it was the best he'd ever had.  It was ok.  A little too sausagey and I thought lasagna was supposed to have lasagna noodles in it???  I went with the calamari marinara/arrabiata or whatever which was pretty good...but Nora's is better and $5 less.  \n\nPortions are huge here, its nice they offer half sizes but I would still opt for the \"regular\" portions since leftovers (ie 2nd meal) is worth having.    You could easily just split a salad and entree with another person and be full.  \n\nI still prefer Nora's and Battista's over this place but its not bad.  I give it 3.5"}
