{"categories":["Massage Therapy","Health & Medical"],"text":"Great massages at great prices!"}
{"categories":["Massage Therapy","Health & Medical"],"text":"I was visiting from out of state and decided on a whim that I needed a massage. The first few places I called were booked, but when I called Bergamot they said they could get me right in!!!  The staff are friendly and inviting, the facility is relaxing and clean, and the prices are very reasonable.  I highly recommend seeing Felipe. He did an amazing job!  Next time I'm in town I will be going back!"}
{"categories":["Massage Therapy","Health & Medical"],"text":"Good massage, nice environment and professional staff. I'll return to this business in the future."}
{"categories":["Massage Therapy","Health & Medical"],"text":"I gave this place a try because coworkers LOVED their chair massages.  I can see why.  I had the Hot Stone massage and I am extremely pleased.  They are super friendly, ask questions so they know what areas to concentrate on or avoid and did a great job."}
{"categories":["Massage Therapy","Health & Medical"],"text":"I took a chance because  the location was convenient to my hotel.  One of the best decisions I ever made. I walked in with pain, and I left feeling great.  Megan did such a great job I bought my daughter a gift card.  I will return."}
{"categories":["Massage Therapy","Health & Medical"],"text":"I found this place when I was located in Madison several years ago, but unfortunately have moved away about two years ago. Ever since I've moved away, I look forward to the summers when I'm willing enough to return to Madison and always book a massage here when I do.\n\nFrom my first massage to my most recent one last week, Seth has done an amazing job at being friendly, helping me relax, using the right pressure, and never cutting edges with time or services. I've had a regular massage, hot stone massage, body wrap, and body scrub. Whatever you're looking for, call up Seth for a friendly and convenient booking at good prices, an excellent 5-star massage that I haven't found elsewhere, and a relaxing time that you won't regret."}
{"categories":["Massage Therapy","Health & Medical"],"text":"Bergamot Massage is a GEM of a find in Madison.  It is a locally owned business with caring, compassionate massage therapists who really understand how to use massage in a holistic way.  Seth is my usual therapist, and for a yoga teacher with a persnickity body, he's a treasure.  Sometimes I go for a therapeutic session, sometimes for just a relaxation. He always meets me where I am, as he is really THAT good.  He takes the time to understand what is going on with you as a WHOLE and works with your body.  He is kind, friendly, professional, and I can't recommend him enough. \n\nOn top of everything they have a cute boutique, which is a great place for a gift.  Give a gift certificate to someone you love, they will LOVE IT:)"}
{"categories":["Massage Therapy","Health & Medical"],"text":"The young lady - Megan - who gave me a massage was really great - attentive and very professional. Sadly the blonde girl at the front desk and the rotund, bearded guy were not. At all. \n\nOn arrival - my first time there - while 'signing in' - I hear both make fun of my strong foreign accent - not the kind of thing you want to experience when trying to relax and forget the world. So the massage is great - but sadly the administration and 'welcome' very poor - soured it.\n\nAfter talking to friends this weekend about this massage therapy place - they all thought I had been way too easy on the joint so am dropping this to 1 star - I would drop it to zero if could - they were very unprofessional."}
{"categories":["Massage Therapy","Health & Medical"],"text":"I love this place!! I started going once a month and now I am up to once a week!! I think it's hard to find a massage therapist that you really like, but I have found my home here!!!"}
{"categories":["Massage Therapy","Health & Medical"],"text":"This place is fantastic. They use great products, very friendly staff and can often (not always) accommodate same-day appointments with someone on their staff. I've used several masseurs but Fillipo is the best."}
{"categories":["Massage Therapy","Health & Medical"],"text":"Always one of the best days of my month when I come here. Been a member for awhile, tried four different MTs and they were all good with their own technique. Clean, relaxed environment. Prices are pretty standard/fair for this line of service."}
{"categories":["Massage Therapy","Health & Medical"],"text":"Outstanding massage therapy. After three days of horrible neck pain, I called around to the usual places only to find that absolutely nowhere had last-minute availability. A friend recommended calling Bergamot and they fit me in within two hours. The boutique was fabulous, the business is locally owned (not a chain), and they pride themselves on giving you the full 60 minutes instead of the usual 50. Jessica did a fantastic job asking about the problem areas and proceeded to treat them amazingly, along with a wonderful full body massage. The prices are quite reasonable and very comparable, the product line is hard to resist, and the services are outstanding. I've definitely found my new favorite place."}
{"categories":["Massage Therapy","Health & Medical"],"text":"I missed my schedule and they charged me full price $75 with out tell me when I book my appointment. Ripped off."}
{"categories":["Massage Therapy","Health & Medical"],"text":"Lovely salon, quick service, quality products.\nI enjoyed my 60 minute massage with Casey. She has a way with stretching that will leave you all losey limbered up. Both my boyfriend and I had massages.\nThe membership is something i am seriously considering. I was impressed that they never pushed a membership. All business is done quietly and discreetly. Rooms are warm and subtle.\n\nThe only thing i would suggest is a music selection option. I wanted to break the digeridoo ten minutes in. My boy, however, had aome lovely orchestral soundtrack music.\nI suppose it depends on the room!\nI reccomend it.\nEnjoy."}
{"categories":["Massage Therapy","Health & Medical"],"text":"I went here for a massage before Christmas because the person to whom I usually go was not available. It was awful. Too much oil. Lots of rubbing oil into my hair. 50% of the time focused on my back and not my neck and shoulders like I had communicated.  But, it was a lot of rubbing oil on my body but not massaging. I chatted with the masseuse afterwards & expressed my disappointment. I wish I had asked for a refund or something."}
{"categories":["Pizza","Italian","Sandwiches","Restaurants"],"text":"Maestro Chris Bianco whips up addictive sandwiches at his laboratory on Central Avenue. Ingredients are local and super-fantastic. Check out what today's market sandwich is -- if it's oven-roasted pork, buy it immediately. Don't miss the rice pudding."}
{"categories":["Pizza","Italian","Sandwiches","Restaurants"],"text":"Once again, everyone is going nuts over anything Chris Bianco touches.  Look, these sandwiches are good - I had a salami and cheese, and my friend had a roated eggplant.  Tried them both, and they are better than something I can make at home.  However, if I wanted to sit at a picnic table breathing in exhaust from Central Ave traffic - well, I wouldn't actually.  the sandwich would have been better if they had real tables - either indoor or on a protected patio, not a homemade bench in a parking lot."}
{"categories":["Pizza","Italian","Sandwiches","Restaurants"],"text":"These sandwiches are the bomb.  You will not be disappointed."}
{"categories":["Pizza","Italian","Sandwiches","Restaurants"],"text":"Yum, yum, yum. The tomato/mozzarella/basil sandwich is to-die-for, the tuna is crazy good too (in either sandwich or salad form). I love that they always have something different for dessert or a local produce treat. One of the girls at the counter has the personality of a cardboard box, but the other girl makes up for it. They have limited hours so make sure they are open before you go or you will be disappointed- especially when you read the mouth-watering menu that is posted in the window. They also have a good selection of drinks to go with your lunch. It is a little pricey and there is no where to sit but outside. My advice is to go with a friend and get two different things to split so for your money you can experience twice as much. You are allowed to go next door to Lux to eat if you buy something there too. I took off one star just based on the lack of seating, especially when trying to dine with a 2 year old."}
